"""
Дан кортеж из 5ти элементов: (4, 30, 2017, 2, 27).
Используя форматированный вывод, выведите числа в заданном порядке и форме:
02  27  2017  04  30
"""
k = (4, 30, 2017, 2, 27)

print("Вывод данных с использованием метода format():")
print('{3:0>2}{4:>4}{2:^8}{0:0>2}{1:>4}'.format(*k))
print("\nВывод данных с использованием f-строки:")
print(f'{k[3]:0>2}{k[4]:>4}{k[2]:^8}{k[0]:0>2}{k[1]:>4}')

# Вывод данных в старом стиле
slovar = {}
for i in range(len(k)):
    if i not in slovar:
        temp = k[i]
        i = str(i)
        slovar[i] = temp
print("\nВывод данных в старом стиле:")
print('%(3)02d%(4)4d%(2)6d  %(0)02d%(1)4d' % slovar)


